Repository: Dunhill69/Mass-Search-Replace
Catalog: translations/*.po
Languages: fr

source: Invalid operation, the "{:s}" key is missing.
fr: Opération non valide, la clé "{:s}" est manquante.

source: Search field "{:s}" is not available for this library
fr: Le champ de recherche "{:s}" n'est pas disponible pour cette bibliothèque

source: Destination field "{:s}" is not available for this library
fr: Le champ de destination "{:s}" n'est pas disponible pour cette bibliothèque

source: Identifier type "{:s}" is not available for this library
fr: Le type d'identifiant "{:s}" n'est pas disponible pour cette bibliothèque

source: Configuration of a Search/Replace operation
fr: Configuration d'une opération de Rechercher/Remplacer

source: Invalid operation
fr: Opération non valide

source: The registering of Find/Replace operation has failed. {:s} Do you want discard the changes?
fr: L'enregistrement de l'opération "Rechercher/Remplacer" a échoué. {:s} Voulez-vous abandonner les modifications ?

source: You must specify a "Search field"
fr: Vous devez spécifier un "Champs de Recherche"

source: Case to be applied
fr: Casse a appliquer

source: Replace mode
fr: Mode de remplacement

source: Search mode
fr: Type de recherche

source: Identifier type
fr: Type d'identifiant

source: Open the template editor
fr: Ouvrir l'éditeur de modèles

source: The field "{:s}" is not defined
fr: Le champ "{:s}" n'est pas définie

source: The operation field "{:s}" contains a invalid value ({:s}).
fr: Le champ de l'opération "{:s}" contient une valeur non valide ({:s}).

source: The value of this field is localized (translated). This can cause problems when using settings shared on internet or when changing the user interface language.
fr: La valeur de ce champ est localisée (traduite). Cela peut poser problème lors de l'utilisation de paramètres partagée sur internet ou d'un changement de la langue de l'interface utilisateur.

source: Applie a list of multiple saved Search/Replace operations
fr: Appliquer une liste de plusieurs Rechercher/Remplacer sauvegardées

source: &Quick Search/Replace...
fr: &Rechercher/Remplacer rapide...

source: &Customize plugin...
fr: &Personnaliser l'extension...

source: Could not to launch Mass Search/Replace
fr: Impossible de lancé Mass Search/Replace

source: No book selected
fr: Aucun livre sélectionné

source: Invalide configuration, the "{:s}" key is missing.
fr: Configuration non valide, la clé "{:s}" est manquante.

source: Cancel
fr: Annuler

source: Mass Search/Replace Progress
fr: Progression de Mass Search/Replace

source: Unhandled exception
fr: Exception non gérée

source: A invalid operations has detected: {:s} Mass Search/Replace was canceled.
fr: Une opération non valide a été détectée : {:s} Mass Search/Replace a été annulée.

source: Mass Search/Replace encountered an error during the library update.
fr: Mass Search/Replace a rencontré une erreur lors de la mise à jour de la bibliothèque.

source: The library a was restored to its original state.
fr: La bibliothèque a été restaurée dans son état d'origine.

source: Cannot update the library
fr: Impossible de mettre à jour la bibliothèque

source: Exceptions during the library update
fr: Exceptions lors de la mise à jour de la bibliothèque

source: {:d} exceptions have occurred during the library update. Some fields may not have been updated.
fr: {:d} exceptions sont survenue lors de la mise à jour de la bibliothèque. Certains champs peuvent ne pas avoir était mis à jour.

source: {:d} invalid operations has detected and have been ignored.
fr: {:d} opérations non valides ont été détectées et ont été ignorées.

source: A invalid operations has detected: {:s} Continue the execution of Mass Search/Replace? Other errors may exist and will be ignored.
fr: Une opération non valide a été détectée : {:s} Poursuivre l'exécution de Mass Search/Replace ? D'autres erreurs peuvent exister et seront ignorées.

source: Search/Replace {:d} of {:d}. Book {:d} of {:d}.
fr: Rechercher/Remplacer {:d} sur {:d}. Livre {:d} sur {:d}.

source: Update the library for {:d} books...
fr: Mise a jour de la bibliothèque pour {:d} livres...

source: Restart required
fr: Redémarrage nécessaire

source: Title image not found - you must restart Calibre before using this plugin!
fr: L'image d'icone n'a pas était trouvée - vous devez redémarrer Calibre avant d'utiliser ce plugin !

source: Keyboard shortcut dialog
fr: Raccourcis clavier

source: Keyboard shortcuts
fr: Raccourcis clavier

source: Interrupt execution
fr: Interrompre l'exécution

source: Stop Mass Search/Replace and display the error normally without further action.
fr: Arrêter Mass Search/Replace et affichez l'erreur normalement sans autre action.

source: Restore the library
fr: Restaurer la bibliothèque

source: Stop Mass Search/Replace and restore the library to its original state.
fr: Arrêter Mass Search/Replace et rétablir la bibliothèque dans son état initial.

source: Updates the fields one by one. This operation can be slower than other strategies.
fr: Met à jour les champs un par un. Cette opération peut être plus lente que les autres stratégies.

source: Carefully executed (slower)
fr: Exécuter prudemment (plus lent)

source: When a error occurs, stop Mass Search/Replace and display the error normally without further action.
fr: Lorsqu'une erreur se produit, arrêté Mass Search/Replace et affiché l'erreur normalement sans autre action.

source: Don't stop (slower, not recomanded)
fr: Ne pas s'arrêter (plus lent, non recommandé)

source: Update the library, no matter how many errors are encountered. The problematics fields will not be updated.
fr: Mettre à jour la bibliothèque, quel que soit le nombre d'erreurs rencontrées. Les champs problématiques ne seront pas mis à jour.

source: Abbort
fr: Abandonner

source: If an invalid operation is detected, abort the changes.
fr: Si une opération non valide est détectée, annulé les modifications.

source: Asked
fr: Demander

source: If an invalid operation is detected, asked whether to continue or abort the changes.
fr: Si une opération non valide est détectée, demandé s'il faut poursuivre ou annuler les modifications.

source: Hidden
fr: Masquer

source: Ignore all invalid operations.
fr: Ignorer toutes les opérations non valide.

source: Select and configure the menu items to display:
fr: Sélectionner et configurer les éléments du menu à afficher :

source: Move menu item up
fr: Déplacer la ligne de menu vers le haut

source: Add menu item
fr: Ajouter une ligne de menu

source: Copy menu item
fr: Copier la ligne de menu

source: Delete menu item
fr: Supprimer une ligne de menu

source: Move menu item down
fr: Déplacer la ligne de menu vers le bas

source: Keyboard shortcuts...
fr: Raccourcis clavier...

source: Edit the keyboard shortcuts associated with this plugin
fr: Modifier les raccourcis clavier associés à cette extension

source: Error strategy...
fr: Stratégie d'erreur...

source: Define the strategy when a error occurs during the library update
fr: Définir la stratégie lorsqu'une erreur se produit lors de la mise à jour de la bibliothèque

source: &Add image...
fr: &Ajouter une image...

source: &Open images folder
fr: &Ouvrir le dossier des images

source: &Import...
fr: &Importer...

source: &Export...
fr: &Exporter...

source: Import failed
fr: Echec de l'importation

source: This is not a valid OWIP export archive
fr: Ceci n'est pas une archive d'exportation OWIP valide

source: Import completed
fr: Importation terminée

source: {:d} menu items imported
fr: {:d} éléments de menu importés

source: Select a menu file archive to import...
fr: Sélectionnez un fichier d'archive de menu à importer...

source: Export failed
fr: Echec de l'exportation

source: No menu items selected to export
fr: Aucun élément de menu sélectionné pour l'exportation

source: Export completed
fr: Exportation terminée

source: {:d} menu items exported to {:s}
fr: {:d} éléments de menu exportés vers {:s}

source: Save menu archive as...
fr: Enregistrer l'archive sous...

source: Add New Image...
fr: Ajouter une nouvelle image...

source: Name
fr: Nom

source: Submenu
fr: Sous-menu

source: Operation
fr: Opération

source: (copy)
fr: (copie)

source: Are you sure you want to delete this menu item?
fr: Êtes-vous sûr de vouloir supprimer cette ligne du menu ?

source: Are you sure you want to delete the selected {:d} menu items?
fr: Êtes-vous sûr de vouloir supprimer les {:d} lignes de menu sélectionnés ?

source: Are you sure?
fr: Êtes-vous sûr ?

source: Change operation list
fr: Modifier la liste des opérations

source: {:d}/{:d} operations
fr: {:d}/{:d} opérations

source: {:d} operations
fr: {:d} opérations

source: Add New Image
fr: Ajouter une nouvelle image

source: &Select image source
fr: &Sélectionner la source de l'image

source: From &web domain favicon
fr: Depuis favicon de site &web

source: From .png &file
fr: Depuis un &fichier .png

source: &Save as filename:
fr: &Enregitrement comme nom de fichier :

source: menu icon dialog
fr: dialogue de l'icône du menu

source: Select a .png file for the menu icon
fr: Sélectionner un fichier .png pour l'icône du menu

source: Cannot import image
fr: Impossible d'importer l'image

source: Source image must be a .png file.
fr: L'image source doit être un fichier .png.

source: You must specify a filename to save as.
fr: Vous devez spécifier un nom de fichier pour l'enregistrer.

source: The save as filename should consist of a filename only.
fr: L'enregitrement en tant que nom de fichier doit consister uniquement en un nom de fichier.

source: An image with this name already exists - overwrite it?
fr: Une image portant ce nom existe déjà, l'écraser ?

source: You must specify a web domain url
fr: Vous devez spécifier une url de site web

source: You must specify a source file.
fr: Vous devez spécifier un fichier source.

source: Source image does not exist!
fr: L'image source n'existe pas !

source: Columns
fr: Colonnes

source: Search
fr: Rechercher

source: Replace
fr: Remplacer

source: List of operations for a quick Search/Replaces
fr: Liste des opérations pour un Rechercher/Remplacer rapide

source: List of Search/Replace operations for {:s}
fr: Liste des opérations de Rechercher/Remplacer pour {:s}

source: Select and configure the order of execution of the operations of Search/Replace operations:
fr: Sélectionner et configurer l'ordre d'exécution des opérations de Rechercher/Remplacer :

source: Move operation up
fr: Déplacer l'opération vers le haut

source: Add operation
fr: Ajouter une opération

source: Copy operation
fr: Copier l'opération de menu

source: Delete operation
fr: Supprimer l'opération

source: Move operation down
fr: Déplacer l'opération vers le bas

source: This is not a valid JSON file
fr: Ceci n'est pas fichier JSON valide

source: Select a JSON file to import...
fr: Sélectionnez un fichier JSON à importer...

source: No operations selected to export
fr: Aucune opérations sélectionné pour l'exportation

source: {:d} operations exported to {:s}
fr: {:d} opérations exportés vers {:s}

source: Save the operations as...
fr: Enregistrer les opérations sous...

source: Are you sure you want to delete this operation?
fr: Êtes-vous sûr de vouloir supprimer cette opération ?

source: Are you sure you want to delete the selected {:d} operations?
fr: Êtes-vous sûr de vouloir supprimer les {:d} opérations ?

source: Error Strategy
fr: Stratégie d'erreur

source: Set the strategy when an invalid operation has detected:
fr: Définir la stratégie lorsqu'une opération non valide est détectée :

source: Define the strategy when a error occurs during the library update:
fr: Définir la stratégie lorsqu'une erreur se produit lors de la mise à jour de la bibliothèque :

source: Unknown
fr: Inconnu(e)

source: Template Error
fr: Erreur de modèle

source: Running the template returned an error:
fr: L'exécution du modèle a renvoyé une erreur :

source: Enter a template to test using data from the selected book
fr: Saisissez un modèle à tester en utilisant les données du livre sélectionné

source: Template editor
fr: Éditeur de modèles
